MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c562xx.h
/*
* @brief RTC Specific device feature definitions
*/

/**
  * @brief Real-Time Clock
  */
typedef struct
{
  __IOM uint32_t TR;              /*!< RTC time register,                                       Address offset: 0x00 */
  __IOM uint32_t DR;              /*!< RTC date register,                                       Address offset: 0x04 */
  __IM  uint32_t SSR;             /*!< RTC subsecond register,                                  Address offset: 0x08 */
  __IOM uint32_t ICSR;            /*!< RTC initialization control and status register,          Address offset: 0x0C */
  __IOM uint32_t PRER;            /*!< RTC prescaler register,                                  Address offset: 0x10 */
  __IOM uint32_t WUTR;            /*!< RTC wake-up timer register,                              Address offset: 0x14 */
  __IOM uint32_t CR;              /*!< RTC control register,                                    Address offset: 0x18 */
  __IOM uint32_t PRIVCFGR;        /*!< RTC privilege mode control register,                     Address offset: 0x1C */
        uint32_t RESERVED1;       /*!< Reserved,                                                Address offset: 0x20 */
  __OM  uint32_t WPR;             /*!< RTC write protection register,                           Address offset: 0x24 */
  __IOM uint32_t CALR;            /*!< RTC calibration register,                                Address offset: 0x28 */
  __OM  uint32_t SHIFTR;          /*!< RTC shift control register,                              Address offset: 0x2C */
  __IM  uint32_t TSTR;            /*!< RTC timestamp time register,                             Address offset: 0x30 */
  __IM  uint32_t TSDR;            /*!< RTC timestamp date register,                             Address offset: 0x34 */
  __IM  uint32_t TSSSR;           /*!< RTC timestamp subsecond register,                        Address offset: 0x38 */
        uint32_t RESERVED2;       /*!< Reserved,                                                Address offset: 0x3C */
  __IOM uint32_t ALRMAR;          /*!< RTC alarm A register,                                    Address offset: 0x40 */
  __IOM uint32_t ALRMASSR;        /*!< RTC alarm A subsecond register,                          Address offset: 0x44 */
  __IOM uint32_t ALRMBR;          /*!< RTC alarm B register,                                    Address offset: 0x48 */
  __IOM uint32_t ALRMBSSR;        /*!< RTC alarm B subsecond register,                          Address offset: 0x4C */
  __IM  uint32_t SR;              /*!< RTC status register,                                     Address offset: 0x50 */
  __IM  uint32_t MISR;            /*!< RTC masked interrupt status register,                    Address offset: 0x54 */
        uint32_t RESERVED3;       /*!< Reserved,                                                Address offset: 0x58 */
  __OM  uint32_t SCR;             /*!< RTC status clear register,                               Address offset: 0x5C */
       uint32_t RESERVED4[4];     /*!< Reserved                                                 Address offset: 0x60-0x6C */
  __IOM uint32_t ALRABINR;        /*!< RTC alarm A binary mode register,                        Address offset: 0x70 */
  __IOM uint32_t ALRBBINR;        /*!< RTC alarm B binary mode register,                        Address offset: 0x74 */
} RTC_TypeDef;

/**
  * @brief System configuration, boot and security (SBS)
  */
typedef struct
{
        uint32_t RESERVED1[4];  /*!< Reserved,                                                  Address offset: 0x000 */
  __IOM uint32_t HDPLCR;        /*!< SBS temporal isolation control register,                   Address offset: 0x010 */
  __IM  uint32_t HDPLSR;        /*!< SBS temporal isolation status register,                    Address offset: 0x014 */
        uint32_t RESERVED2[59]; /*!< Reserved,                                                  Address offset: 0x018 */
  __IOM uint32_t FPUIMR;        /*!< SBS FPU interrupt mask register,                           Address offset: 0x104 */
  __IOM uint32_t MESR;          /*!< SBS memory erase status register,                          Address offset: 0x108 */
        uint32_t RESERVED3;     /*!< Reserved,                                                  Address offset: 0x10C */
  __IOM uint32_t CCCSR;         /*!< SBS compensation cell for I/Os control and status register,Address offset: 0x110 */
  __IM  uint32_t CCVALR;        /*!< SBS compensation cell for I/Os value register,             Address offset: 0x114 */
  __IOM uint32_t CCSWCR;        /*!< SBS compensation cell for I/Os software code register,     Address offset: 0x118 */
        uint32_t RESERVED4;     /*!< Reserved,                                                  Address offset: 0x11C */
  __IOM uint32_t CFGR2;         /*!< SBS Class B register,                                      Address offset: 0x120 */
        uint32_t RESERVED5[8];  /*!< Reserved,                                                  Address offset: 0x124 */
  __IOM uint32_t CLCKR;         /*!< SBS CPU lock register,                                     Address offset: 0x144 */
        uint32_t RESERVED6;     /*!< Reserved,                                                  Address offset: 0x148 */
  __IOM uint32_t ECCNMIR;       /*!< SBS ECC NMI mask register,                                 Address offset: 0x14C */
} SBS_TypeDef;

/**
  * @brief Serial peripheral interface (SPI)
  */
typedef struct
{
  __IOM uint32_t CR1;           /*!< SPI/I2S Control register 1,                      Address offset: 0x00 */
  __IOM uint32_t CR2;           /*!< SPI Control register 2,                          Address offset: 0x04 */
  __IOM uint32_t CFG1;          /*!< SPI Configuration register 1,                    Address offset: 0x08 */
  __IOM uint32_t CFG2;          /*!< SPI Configuration register 2,                    Address offset: 0x0C */
  __IOM uint32_t IER;           /*!< SPI Interrupt Enable register,                   Address offset: 0x10 */
  __IM  uint32_t SR;            /*!< SPI Status register,                             Address offset: 0x14 */
  __OM  uint32_t IFCR;          /*!< SPI Interrupt/Status Flags Clear register,       Address offset: 0x18 */
  __IOM uint32_t AUTOCR;        /*!< SPI Autonomous Mode Control register,            Address offset: 0x1C */
  __OM  uint32_t TXDR;          /*!< SPI Transmit data register,                      Address offset: 0x20 */
        uint32_t RESERVED1[3];  /*!< Reserved,                                        Address offset: 0x24 */
  __IM  uint32_t RXDR;          /*!< SPI/I2S data register,                           Address offset: 0x30 */
        uint32_t RESERVED2[3];  /*!< Reserved,                                        Address offset: 0x34 */
  __IOM uint32_t CRCPOLY;       /*!< SPI CRC Polynomial register,                     Address offset: 0x40 */
  __IM  uint32_t TXCRC;         /*!< SPI Transmitter CRC register,                    Address offset: 0x44 */
  __IM  uint32_t RXCRC;         /*!< SPI Receiver CRC register,                       Address offset: 0x48 */
  __IOM uint32_t UDRDR;         /*!< SPI Underrun data register,                      Address offset: 0x4C */
  __IOM uint32_t I2SCFGR;       /*!< I2S Configuration register,                      Address offset: 0x50 */
} SPI_TypeDef;

/**
  * @brief Tamper and backup registers
  */
typedef struct
{
  __IOM uint32_t CR1;              /*!< TAMP control register 1,                         Address offset: 0x000 */
  __IOM uint32_t CR2;              /*!< TAMP control register 2,                         Address offset: 0x004 */
  __IOM uint32_t CR3;              /*!< TAMP control register 3,                         Address offset: 0x008 */
  __IOM uint32_t FLTCR;            /*!< TAMP filter control register,                    Address offset: 0x00C */
        uint32_t RESERVED1[4];     /*!< Reserved,                                        Address offset: 0x010-0x01C */
  __IOM uint32_t CFGR;             /*!< TAMP configuration register,                     Address offset: 0x020 */
  __IOM uint32_t PRIVCFGR;         /*!< TAMP privilege configuration register,           Address offset: 0x024 */
        uint32_t RESERVED2;        /*!< Reserved,                                        Address offset: 0x028 */
  __IOM uint32_t IER;              /*!< TAMP interrupt enable register,                  Address offset: 0x02C */
  __IM  uint32_t SR;               /*!< TAMP status register,                            Address offset: 0x030 */
  __IM  uint32_t MISR;             /*!< TAMP masked interrupt status register,           Address offset: 0x034 */
        uint32_t RESERVED3;        /*!< Reserved,                                        Address offset: 0x038 */
  __OM  uint32_t SCR;              /*!< TAMP status clear register,                      Address offset: 0x03C */
        uint32_t RESERVED4[4];     /*!< Reserved,                                        Address offset: 0x040-0x04C */
  __IOM uint32_t OR;               /*!< TAMP option register,                            Address offset: 0x050 */
        uint32_t RESERVED5[43];    /*!< Reserved,                                        Address offset: 0x054-0x0FC */
  __IOM uint32_t BKP0R;            /*!< TAMP backup register 0,                          Address offset: 0x100 */
  __IOM uint32_t BKP1R;            /*!< TAMP backup register 1,                          Address offset: 0x104 */
  __IOM uint32_t BKP2R;            /*!< TAMP backup register 2,                          Address offset: 0x108 */
  __IOM uint32_t BKP3R;            /*!< TAMP backup register 3,                          Address offset: 0x10C */
  __IOM uint32_t BKP4R;            /*!< TAMP backup register 4,                          Address offset: 0x110 */
  __IOM uint32_t BKP5R;            /*!< TAMP backup register 5,                          Address offset: 0x114 */
  __IOM uint32_t BKP6R;            /*!< TAMP backup register 6,                          Address offset: 0x118 */
  __IOM uint32_t BKP7R;            /*!< TAMP backup register 7,                          Address offset: 0x11C */
  __IOM uint32_t BKP8R;            /*!< TAMP backup register 8,                          Address offset: 0x120 */
  __IOM uint32_t BKP9R;            /*!< TAMP backup register 9,                          Address offset: 0x124 */
  __IOM uint32_t BKP10R;           /*!< TAMP backup register 10,                         Address offset: 0x128 */
  __IOM uint32_t BKP11R;           /*!< TAMP backup register 11,                         Address offset: 0x12C */
  __IOM uint32_t BKP12R;           /*!< TAMP backup register 12,                         Address offset: 0x130 */
  __IOM uint32_t BKP13R;           /*!< TAMP backup register 13,                         Address offset: 0x134 */
  __IOM uint32_t BKP14R;           /*!< TAMP backup register 14,                         Address offset: 0x138 */
  __IOM uint32_t BKP15R;           /*!< TAMP backup register 15,                         Address offset: 0x13C */
  __IOM uint32_t BKP16R;           /*!< TAMP backup register 16,                         Address offset: 0x140 */
  __IOM uint32_t BKP17R;           /*!< TAMP backup register 17,                         Address offset: 0x144 */
  __IOM uint32_t BKP18R;           /*!< TAMP backup register 18,                         Address offset: 0x148 */
  __IOM uint32_t BKP19R;           /*!< TAMP backup register 19,                         Address offset: 0x14C */
  __IOM uint32_t BKP20R;           /*!< TAMP backup register 20,                         Address offset: 0x150 */
  __IOM uint32_t BKP21R;           /*!< TAMP backup register 21,                         Address offset: 0x154 */
  __IOM uint32_t BKP22R;           /*!< TAMP backup register 22,                         Address offset: 0x158 */
  __IOM uint32_t BKP23R;           /*!< TAMP backup register 23,                         Address offset: 0x15C */
  __IOM uint32_t BKP24R;           /*!< TAMP backup register 24,                         Address offset: 0x160 */
  __IOM uint32_t BKP25R;           /*!< TAMP backup register 25,                         Address offset: 0x164 */
  __IOM uint32_t BKP26R;           /*!< TAMP backup register 26,                         Address offset: 0x168 */
  __IOM uint32_t BKP27R;           /*!< TAMP backup register 27,                         Address offset: 0x16C */
  __IOM uint32_t BKP28R;           /*!< TAMP backup register 28,                         Address offset: 0x170 */
  __IOM uint32_t BKP29R;           /*!< TAMP backup register 29,                         Address offset: 0x174 */
  __IOM uint32_t BKP30R;           /*!< TAMP backup register 30,                         Address offset: 0x178 */
  __IOM uint32_t BKP31R;           /*!< TAMP backup register 31,                         Address offset: 0x17C */
} TAMP_TypeDef;

/**
  * @brief TIM Address block
  */
typedef struct
{
  __IOM uint32_t CR1;             /*!< TIM control register 1,                                  Address offset: 0x000 */
  __IOM uint32_t CR2;             /*!< TIM control register 2,                                  Address offset: 0x004 */
  __IOM uint32_t SMCR;            /*!< TIM slave mode control register,                         Address offset: 0x008 */
  __IOM uint32_t DIER;            /*!< TIM DMA/interrupt enable register,                       Address offset: 0x00C */
  __IOM uint32_t SR;              /*!< TIM status register,                                     Address offset: 0x010 */
  __IOM uint32_t EGR;             /*!< TIM event generation register,                           Address offset: 0x014 */
  __IOM uint32_t CCMR1;           /*!< TIM capture/compare mode register 1 [alternate],         Address offset: 0x018 */
  __IOM uint32_t CCMR2;           /*!< TIM capture/compare mode register 2 [alternate],         Address offset: 0x01C */
  __IOM uint32_t CCER;            /*!< TIM capture/compare enable register,                     Address offset: 0x020 */
  __IOM uint32_t CNT;             /*!< TIM counter,                                             Address offset: 0x024 */
  __IOM uint32_t PSC;             /*!< TIM prescaler,                                           Address offset: 0x028 */
  __IOM uint32_t ARR;             /*!< TIM autoreload register,                                 Address offset: 0x02C */
  __IOM uint32_t RCR;             /*!< TIM repetition counter register,                         Address offset: 0x030 */
  __IOM uint32_t CCR1;            /*!< TIM capture/compare register 1,                          Address offset: 0x034 */
  __IOM uint32_t CCR2;            /*!< TIM capture/compare register 2,                          Address offset: 0x038 */
  __IOM uint32_t CCR3;            /*!< TIM capture/compare register 3,                          Address offset: 0x03C */
  __IOM uint32_t CCR4;            /*!< TIM capture/compare register 4,                          Address offset: 0x040 */
  __IOM uint32_t BDTR;            /*!< TIM break and dead-time register,                        Address offset: 0x044 */
  __IOM uint32_t CCR5;            /*!< TIM capture/compare register 5,                          Address offset: 0x048 */
  __IOM uint32_t CCR6;            /*!< TIM capture/compare register 6,                          Address offset: 0x04C */
  __IOM uint32_t CCMR3;           /*!< TIM capture/compare mode register 3,                     Address offset: 0x050 */
  __IOM uint32_t DTR2;            /*!< TIM timer deadtime register 2,                           Address offset: 0x054 */
  __IOM uint32_t ECR;             /*!< TIM timer encoder control register,                      Address offset: 0x058 */
  __IOM uint32_t TISEL;           /*!< TIM timer input selection register,                      Address offset: 0x05C */
  __IOM uint32_t AF1;             /*!< TIM alternate function option register 1,                Address offset: 0x060 */
  __IOM uint32_t AF2;             /*!< TIM alternate function register 2,                       Address offset: 0x064 */
       uint32_t RESERVED1[2];     /*!< Reserved,                                                Address offset: 0x068 - 0x06C */
  __IOM uint32_t CCR7;            /*!< TIM capture/compare register 7,                          Address offset: 0x070 */
       uint32_t RESERVED2;        /*!< Reserved,                                                Address offset: 0x074 */
  __IOM uint32_t CCMR4;           /*!< TIM capture/compare mode register 4,                     Address offset: 0x078 */
       uint32_t RESERVED3[5];     /*!< Reserved,                                                Address offset: 0x07C - 0x08C */
  __IOM uint32_t MPR1;            /*!< TIM multilevel protection register 1,                    Address offset: 0x090 */
  __IOM uint32_t MPR2;            /*!< TIM multilevel protection register 2,                    Address offset: 0x094 */
       uint32_t RESERVED4[2];     /*!< Reserved,                                                Address offset: 0x098 - 0x09C */
  __IOM uint32_t OOR;             /*!< TIM output override register,                            Address offset: 0x0A0 */
       uint32_t RESERVED5[206];   /*!< Reserved,                                                Address offset: 0x0A4 - 0x3D8 */
  __IOM uint32_t DCR;             /*!< TIM DMA control register,                                Address offset: 0x3DC */
  __IOM uint32_t DMAR;            /*!< TIM DMA address for full transfer,                       Address offset: 0x3E0 */
} TIM_TypeDef;

/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */
typedef struct
{
  __IOM uint32_t CR1;         /*!< USART Control register 1,                 Address offset: 0x00  */
  __IOM uint32_t CR2;         /*!< USART Control register 2,                 Address offset: 0x04  */
  __IOM uint32_t CR3;         /*!< USART Control register 3,                 Address offset: 0x08  */
  __IOM uint32_t BRR;         /*!< USART Baud rate register,                 Address offset: 0x0C  */
  __IOM uint32_t GTPR;        /*!< USART Guard time and prescaler register,  Address offset: 0x10  */
  __IOM uint32_t RTOR;        /*!< USART Receiver Time Out register,         Address offset: 0x14  */
  __OM  uint32_t RQR;         /*!< USART Request register,                   Address offset: 0x18  */
  __IM  uint32_t ISR;         /*!< USART Interrupt and status register,      Address offset: 0x1C  */
  __OM  uint32_t ICR;         /*!< USART Interrupt flag Clear register,      Address offset: 0x20  */
  __IM  uint32_t RDR;         /*!< USART Receive Data register,              Address offset: 0x24  */
  __IOM uint32_t TDR;         /*!< USART Transmit Data register,             Address offset: 0x28  */
  __IOM uint32_t PRESC;       /*!< USART Prescaler register,                 Address offset: 0x2C  */
} USART_TypeDef;

/**
  * @brief Universal Serial Bus Full Speed Dual Role Device
  */
typedef struct
{
  __IOM uint32_t CHEP0R;          /*!< USB Channel/Endpoint 0 register,      Address offset: 0x00 */
  __IOM uint32_t CHEP1R;          /*!< USB Channel/Endpoint 1 register,      Address offset: 0x04 */
  __IOM uint32_t CHEP2R;          /*!< USB Channel/Endpoint 2 register,      Address offset: 0x08 */
  __IOM uint32_t CHEP3R;          /*!< USB Channel/Endpoint 3 register,      Address offset: 0x0C */
  __IOM uint32_t CHEP4R;          /*!< USB Channel/Endpoint 4 register,      Address offset: 0x10 */
  __IOM uint32_t CHEP5R;          /*!< USB Channel/Endpoint 5 register,      Address offset: 0x14 */
  __IOM uint32_t CHEP6R;          /*!< USB Channel/Endpoint 6 register,      Address offset: 0x18 */
  __IOM uint32_t CHEP7R;          /*!< USB Channel/Endpoint 7 register,      Address offset: 0x1C */
        uint32_t RESERVED1[8];    /*!< Reserved,                             Address offset: 0x20 */
  __IOM uint32_t CNTR;            /*!< Control register,                     Address offset: 0x40 */
  __IOM uint32_t ISTR;            /*!< Interrupt status register,            Address offset: 0x44 */
  __IM  uint32_t FNR;             /*!< Frame number register,                Address offset: 0x48 */
  __IOM uint32_t DADDR;           /*!< Device address register,              Address offset: 0x4C */
        uint32_t RESERVED2;       /*!< Reserved,                             Address offset: 0x50 */
  __IOM uint32_t LPMCSR;          /*!< LPM Control and Status register,      Address offset: 0x54 */
  __IOM uint32_t BCDR;            /*!< Battery Charging detector register,   Address offset: 0x58 */
} USB_DRD_TypeDef;

/**
  * @brief Universal Serial Bus PacketMemoryArea Buffer Descriptor Table
  */
typedef struct
{
  __IOM uint32_t TXBD;             /*!<Transmission buffer address */
  __IOM uint32_t RXBD;             /*!<Reception buffer address    */
} USB_DRD_PMABuffDescTypeDef;

/**
  * @brief WWDG
  */
typedef struct
{
__IOM uint32_t CR;               /*!< WWDG Control register,       Address offset: 0x00 */
__IOM uint32_t CFR;              /*!< WWDG Configuration register, Address offset: 0x04 */
__IOM uint32_t SR;               /*!< WWDG Status register,        Address offset: 0x08 */
} WWDG_TypeDef;

/*@}*/ /* end of group STM32C5xx_peripherals */


/* --------  End of section using anonymous unions and disabling warnings  -------- */
#if   defined (__CC_ARM)
#pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
#pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif /*__CC_ARM */

