MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c562xx.h
#define FLASH_SIZE_MAX               (0x00080000UL)                                      /* 512 Kbytes user flash */
#define FLASH_PAGE_NB_MAX            (0x20U)                                             /* Page number in bank */
#define FLASH_SIZE                   ((((*((uint16_t *)FLASHSIZE_BASE)) == 0xFFFFU)) ? FLASH_SIZE_MAX : \
                                     ((((*((uint16_t *)FLASHSIZE_BASE)) == 0x0000U)) ? FLASH_SIZE_MAX : \
                                     (((uint32_t)(*((uint16_t *)FLASHSIZE_BASE)) & (0xFFFFU)) << 10U)))
#define FLASH_OTP_SIZE               (0x1200U)                                           /* 2 Kbytes OTP
                                                                                            (one-time programmable)
                                                                                            */
#define FLASH_EXT_USER_SIZE          (0x10000UL)                                         /* 64 Kbytes of Flash
                                                                                            extended memory
                                                                                            if configured
                                                                                            as user flash */
#define FLASH_EDATA_SIZE             (0xC000U)                                           /* 48 Kbytes of Flash
                                                                                            data memory
                                                                                            if configured
                                                                                            as data flash */
#define FLASH_BANK_SIZE              (FLASH_SIZE >> 1U)                                  /* 256 Kbytes per bank
                                                                                             */
#define FLASH_PAGE_SIZE              0x2000U                                             /* 8 Kbytes pages
                                                                                            */
#define FLASH_EXT_USER_BANK_SIZE     (FLASH_EXT_USER_SIZE >> 1U)
#define FLASH_EXT_USER_PAGE_SIZE     0x0800U                                             /* 2 Kbytes pages
                                                                                            in additional
                                                                                            Extended USER area */
#define FLASH_EDATA_BANK_SIZE        (FLASH_EDATA_SIZE >> 1U)
#define FLASH_EDATA_PAGE_SIZE        0x0600U                                             /* 1.5 Kbytes pages
                                                                                            in additional
                                                                                            EDATA area */
#define FLASH_BANK_NB                (2U)                                                /* Number of
                                                                                             FLASH memory
                                                                                             banks */
#define FLASH_PAGE_NB                (FLASH_BANK_SIZE/FLASH_PAGE_SIZE)                   /* Number of
                                                                                             USER pages
                                                                                             per bank */
#define FLASH_EXT_USER_PAGE_NB       (FLASH_EXT_USER_BANK_SIZE/FLASH_EXT_USER_PAGE_SIZE) /* Number of
                                                                                             EDATA pages
                                                                                             per bank */
#define FLASH_EDATA_PAGE_NB          (FLASH_EDATA_BANK_SIZE/FLASH_EDATA_PAGE_SIZE)       /* Number of
                                                                                             Extended USER
                                                                                             pages per bank */
#define FLASH_WRP_GROUP_WIDTH        (1U)

/* ************************************  Bit definition for FLASH_ACR register  ************************************* */
#define FLASH_ACR_LATENCY_Pos               (0U)
#define FLASH_ACR_LATENCY_Msk               (0xFUL << FLASH_ACR_LATENCY_Pos)                 /*!< 0x0000000F */
#define FLASH_ACR_LATENCY                   FLASH_ACR_LATENCY_Msk                            /*!< Read latency */
#define FLASH_ACR_LATENCY_0                 (0x1UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_1                 (0x2UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_2                 (0x3UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_3                 (0x4UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_4                 (0x5UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_5                 (0x6UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_6                 (0x7UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_7                 (0x8UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_8                 (0x9UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_9                 (0xAUL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_10                (0xBUL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_11                (0xCUL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_12                (0xDUL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_13                (0xEUL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_14                (0xFUL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_WRHIGHFREQ_Pos            (4U)
#define FLASH_ACR_WRHIGHFREQ_Msk            (0x3UL << FLASH_ACR_WRHIGHFREQ_Pos)              /*!< 0x00000030 */
#define FLASH_ACR_WRHIGHFREQ                FLASH_ACR_WRHIGHFREQ_Msk                         /*!< FLASH signal delay */
#define FLASH_ACR_WRHIGHFREQ_0              (0x1UL << FLASH_ACR_WRHIGHFREQ_Pos)              /*!< 0x00000010 */
#define FLASH_ACR_WRHIGHFREQ_1              (0x2UL << FLASH_ACR_WRHIGHFREQ_Pos)              /*!< 0x00000020 */
#define FLASH_ACR_PRFTEN_Pos                (8U)
#define FLASH_ACR_PRFTEN_Msk                (0x1UL << FLASH_ACR_PRFTEN_Pos)                  /*!< 0x00000100 */
#define FLASH_ACR_PRFTEN                    FLASH_ACR_PRFTEN_Msk                             /*!< Prefetch enable */
#define FLASH_ACR_EMPTY_Pos                 (16U)
#define FLASH_ACR_EMPTY_Msk                 (0x1UL << FLASH_ACR_EMPTY_Pos)                   /*!< 0x00010000 */
#define FLASH_ACR_EMPTY                     FLASH_ACR_EMPTY_Msk                              /*!< Main Flash memory area
                                                                                                  empty (not reset by
                                                                                                  system reset) */

/* ************************************  Bit definition for FLASH_KEYR register  ************************************ */
#define FLASH_KEYR_KEY_Pos                  (0U)
#define FLASH_KEYR_KEY_Msk                  (0xFFFFFFFFUL << FLASH_KEYR_KEY_Pos)             /*!< 0xFFFFFFFF */
#define FLASH_KEYR_KEY                      FLASH_KEYR_KEY_Msk                               /*!< Non-volatile
                                                                                                  memoryconfiguration
                                                                                                  access unlock key */

