MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c562xx.h
/* *************************************  Bit definition for FLASH_CR register  ************************************* */
#define FLASH_CR_LOCK_Pos                   (0U)
#define FLASH_CR_LOCK_Msk                   (0x1UL << FLASH_CR_LOCK_Pos)                     /*!< 0x00000001 */
#define FLASH_CR_LOCK                       FLASH_CR_LOCK_Msk                                /*!< configuration lock bit
                                                                                                  */
#define FLASH_CR_PG_Pos                     (1U)
#define FLASH_CR_PG_Msk                     (0x1UL << FLASH_CR_PG_Pos)                       /*!< 0x00000002 */
#define FLASH_CR_PG                         FLASH_CR_PG_Msk                                  /*!< programming control
                                                                                                  bit */
#define FLASH_CR_PER_Pos                    (2U)
#define FLASH_CR_PER_Msk                    (0x1UL << FLASH_CR_PER_Pos)                      /*!< 0x00000004 */
#define FLASH_CR_PER                        FLASH_CR_PER_Msk                                 /*!< page erase request */
#define FLASH_CR_BER_Pos                    (3U)
#define FLASH_CR_BER_Msk                    (0x1UL << FLASH_CR_BER_Pos)                      /*!< 0x00000008 */
#define FLASH_CR_BER                        FLASH_CR_BER_Msk                                 /*!< Bank erase request */
#define FLASH_CR_FW_Pos                     (4U)
#define FLASH_CR_FW_Msk                     (0x1UL << FLASH_CR_FW_Pos)                       /*!< 0x00000010 */
#define FLASH_CR_FW                         FLASH_CR_FW_Msk                                  /*!< write forcing control
                                                                                                  bit */
#define FLASH_CR_STRT_Pos                   (5U)
#define FLASH_CR_STRT_Msk                   (0x1UL << FLASH_CR_STRT_Pos)                     /*!< 0x00000020 */
#define FLASH_CR_STRT                       FLASH_CR_STRT_Msk                                /*!< erase start control
                                                                                                  bit */
#define FLASH_CR_PNB_Pos                    (6U)
#define FLASH_CR_PNB_Msk                    (0x3FUL << FLASH_CR_PNB_Pos)                     /*!< 0x00000FC0 */
#define FLASH_CR_PNB                        FLASH_CR_PNB_Msk                                 /*!< Page erase selection
                                                                                                  number */
#define FLASH_CR_MER_Pos                    (15U)
#define FLASH_CR_MER_Msk                    (0x1UL << FLASH_CR_MER_Pos)                      /*!< 0x00008000 */
#define FLASH_CR_MER                        FLASH_CR_MER_Msk                                 /*!< Mass erase request */
#define FLASH_CR_EOPIE_Pos                  (16U)
#define FLASH_CR_EOPIE_Msk                  (0x1UL << FLASH_CR_EOPIE_Pos)                    /*!< 0x00010000 */
#define FLASH_CR_EOPIE                      FLASH_CR_EOPIE_Msk                               /*!< end of operation
                                                                                                  interrupt control bit
                                                                                                  */
#define FLASH_CR_WRPERRIE_Pos               (17U)
#define FLASH_CR_WRPERRIE_Msk               (0x1UL << FLASH_CR_WRPERRIE_Pos)                 /*!< 0x00020000 */
#define FLASH_CR_WRPERRIE                   FLASH_CR_WRPERRIE_Msk                            /*!< write protection error
                                                                                                  interrupt enable bit
                                                                                                  */
#define FLASH_CR_PGSERRIE_Pos               (18U)
#define FLASH_CR_PGSERRIE_Msk               (0x1UL << FLASH_CR_PGSERRIE_Pos)                 /*!< 0x00040000 */
#define FLASH_CR_PGSERRIE                   FLASH_CR_PGSERRIE_Msk                            /*!< programming sequence
                                                                                                  error interrupt enable
                                                                                                  bit */
#define FLASH_CR_STRBERRIE_Pos              (19U)
#define FLASH_CR_STRBERRIE_Msk              (0x1UL << FLASH_CR_STRBERRIE_Pos)                /*!< 0x00080000 */
#define FLASH_CR_STRBERRIE                  FLASH_CR_STRBERRIE_Msk                           /*!< strobe error interrupt
                                                                                                  enable bit */
#define FLASH_CR_INCERRIE_Pos               (20U)
#define FLASH_CR_INCERRIE_Msk               (0x1UL << FLASH_CR_INCERRIE_Pos)                 /*!< 0x00100000 */
#define FLASH_CR_INCERRIE                   FLASH_CR_INCERRIE_Msk                            /*!< inconsistency error
                                                                                                  interrupt enable bit
                                                                                                  */
#define FLASH_CR_OPTCHANGEERRIE_Pos         (23U)
#define FLASH_CR_OPTCHANGEERRIE_Msk         (0x1UL << FLASH_CR_OPTCHANGEERRIE_Pos)           /*!< 0x00800000 */
#define FLASH_CR_OPTCHANGEERRIE             FLASH_CR_OPTCHANGEERRIE_Msk                      /*!< Option-byte change
                                                                                                  error interrupt enable
                                                                                                  bit */
#define FLASH_CR_EDATASEL_Pos               (29U)
#define FLASH_CR_EDATASEL_Msk               (0x1UL << FLASH_CR_EDATASEL_Pos)                 /*!< 0x20000000 */
#define FLASH_CR_EDATASEL                   FLASH_CR_EDATASEL_Msk                            /*!< EDATA erase selector
                                                                                                  bit */
#define FLASH_CR_BKSEL_Pos                  (31U)
#define FLASH_CR_BKSEL_Msk                  (0x1UL << FLASH_CR_BKSEL_Pos)                    /*!< 0x80000000 */
#define FLASH_CR_BKSEL                      FLASH_CR_BKSEL_Msk                               /*!< Bank selector bit */

