MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c562xx.h
/* ************************************  Bit definition for GPIO_BSRR register  ************************************* */
#define GPIO_BSRR_BS0_Pos          (0U)
#define GPIO_BSRR_BS0_Msk          (0x1UL << GPIO_BSRR_BS0_Pos)          /*!< 0x00000001 */
#define GPIO_BSRR_BS0              GPIO_BSRR_BS0_Msk                     /*!< Port x set I/O pin y */
#define GPIO_BSRR_BS1_Pos          (1U)
#define GPIO_BSRR_BS1_Msk          (0x1UL << GPIO_BSRR_BS1_Pos)          /*!< 0x00000002 */
#define GPIO_BSRR_BS1              GPIO_BSRR_BS1_Msk                     /*!< Port x set I/O pin y */
#define GPIO_BSRR_BS2_Pos          (2U)
#define GPIO_BSRR_BS2_Msk          (0x1UL << GPIO_BSRR_BS2_Pos)          /*!< 0x00000004 */
#define GPIO_BSRR_BS2              GPIO_BSRR_BS2_Msk                     /*!< Port x set I/O pin y */
#define GPIO_BSRR_BS3_Pos          (3U)
#define GPIO_BSRR_BS3_Msk          (0x1UL << GPIO_BSRR_BS3_Pos)          /*!< 0x00000008 */
#define GPIO_BSRR_BS3              GPIO_BSRR_BS3_Msk                     /*!< Port x set I/O pin y */
#define GPIO_BSRR_BS4_Pos          (4U)
#define GPIO_BSRR_BS4_Msk          (0x1UL << GPIO_BSRR_BS4_Pos)          /*!< 0x00000010 */
#define GPIO_BSRR_BS4              GPIO_BSRR_BS4_Msk                     /*!< Port x set I/O pin y */
#define GPIO_BSRR_BS5_Pos          (5U)
#define GPIO_BSRR_BS5_Msk          (0x1UL << GPIO_BSRR_BS5_Pos)          /*!< 0x00000020 */
#define GPIO_BSRR_BS5              GPIO_BSRR_BS5_Msk                     /*!< Port x set I/O pin y */
#define GPIO_BSRR_BS6_Pos          (6U)
#define GPIO_BSRR_BS6_Msk          (0x1UL << GPIO_BSRR_BS6_Pos)          /*!< 0x00000040 */
#define GPIO_BSRR_BS6              GPIO_BSRR_BS6_Msk                     /*!< Port x set I/O pin y */
#define GPIO_BSRR_BS7_Pos          (7U)
#define GPIO_BSRR_BS7_Msk          (0x1UL << GPIO_BSRR_BS7_Pos)          /*!< 0x00000080 */
#define GPIO_BSRR_BS7              GPIO_BSRR_BS7_Msk                     /*!< Port x set I/O pin y */
#define GPIO_BSRR_BS8_Pos          (8U)
#define GPIO_BSRR_BS8_Msk          (0x1UL << GPIO_BSRR_BS8_Pos)          /*!< 0x00000100 */
#define GPIO_BSRR_BS8              GPIO_BSRR_BS8_Msk                     /*!< Port x set I/O pin y */
#define GPIO_BSRR_BS9_Pos          (9U)
#define GPIO_BSRR_BS9_Msk          (0x1UL << GPIO_BSRR_BS9_Pos)          /*!< 0x00000200 */
#define GPIO_BSRR_BS9              GPIO_BSRR_BS9_Msk                     /*!< Port x set I/O pin y */
#define GPIO_BSRR_BS10_Pos         (10U)
#define GPIO_BSRR_BS10_Msk         (0x1UL << GPIO_BSRR_BS10_Pos)         /*!< 0x00000400 */
#define GPIO_BSRR_BS10             GPIO_BSRR_BS10_Msk                    /*!< Port x set I/O pin y */
#define GPIO_BSRR_BS11_Pos         (11U)
#define GPIO_BSRR_BS11_Msk         (0x1UL << GPIO_BSRR_BS11_Pos)         /*!< 0x00000800 */
#define GPIO_BSRR_BS11             GPIO_BSRR_BS11_Msk                    /*!< Port x set I/O pin y */
#define GPIO_BSRR_BS12_Pos         (12U)
#define GPIO_BSRR_BS12_Msk         (0x1UL << GPIO_BSRR_BS12_Pos)         /*!< 0x00001000 */
#define GPIO_BSRR_BS12             GPIO_BSRR_BS12_Msk                    /*!< Port x set I/O pin y */
#define GPIO_BSRR_BS13_Pos         (13U)
#define GPIO_BSRR_BS13_Msk         (0x1UL << GPIO_BSRR_BS13_Pos)         /*!< 0x00002000 */
#define GPIO_BSRR_BS13             GPIO_BSRR_BS13_Msk                    /*!< Port x set I/O pin y */
#define GPIO_BSRR_BS14_Pos         (14U)
#define GPIO_BSRR_BS14_Msk         (0x1UL << GPIO_BSRR_BS14_Pos)         /*!< 0x00004000 */
#define GPIO_BSRR_BS14             GPIO_BSRR_BS14_Msk                    /*!< Port x set I/O pin y */
#define GPIO_BSRR_BS15_Pos         (15U)
#define GPIO_BSRR_BS15_Msk         (0x1UL << GPIO_BSRR_BS15_Pos)         /*!< 0x00008000 */
#define GPIO_BSRR_BS15             GPIO_BSRR_BS15_Msk                    /*!< Port x set I/O pin y */
#define GPIO_BSRR_BR0_Pos          (16U)
#define GPIO_BSRR_BR0_Msk          (0x1UL << GPIO_BSRR_BR0_Pos)          /*!< 0x00010000 */
#define GPIO_BSRR_BR0              GPIO_BSRR_BR0_Msk                     /*!< Port x reset I/O pin y */
#define GPIO_BSRR_BR1_Pos          (17U)
#define GPIO_BSRR_BR1_Msk          (0x1UL << GPIO_BSRR_BR1_Pos)          /*!< 0x00020000 */
#define GPIO_BSRR_BR1              GPIO_BSRR_BR1_Msk                     /*!< Port x reset I/O pin y */
#define GPIO_BSRR_BR2_Pos          (18U)
#define GPIO_BSRR_BR2_Msk          (0x1UL << GPIO_BSRR_BR2_Pos)          /*!< 0x00040000 */
#define GPIO_BSRR_BR2              GPIO_BSRR_BR2_Msk                     /*!< Port x reset I/O pin y */
#define GPIO_BSRR_BR3_Pos          (19U)
#define GPIO_BSRR_BR3_Msk          (0x1UL << GPIO_BSRR_BR3_Pos)          /*!< 0x00080000 */
#define GPIO_BSRR_BR3              GPIO_BSRR_BR3_Msk                     /*!< Port x reset I/O pin y */
#define GPIO_BSRR_BR4_Pos          (20U)
#define GPIO_BSRR_BR4_Msk          (0x1UL << GPIO_BSRR_BR4_Pos)          /*!< 0x00100000 */
#define GPIO_BSRR_BR4              GPIO_BSRR_BR4_Msk                     /*!< Port x reset I/O pin y */
#define GPIO_BSRR_BR5_Pos          (21U)
#define GPIO_BSRR_BR5_Msk          (0x1UL << GPIO_BSRR_BR5_Pos)          /*!< 0x00200000 */
#define GPIO_BSRR_BR5              GPIO_BSRR_BR5_Msk                     /*!< Port x reset I/O pin y */
#define GPIO_BSRR_BR6_Pos          (22U)
#define GPIO_BSRR_BR6_Msk          (0x1UL << GPIO_BSRR_BR6_Pos)          /*!< 0x00400000 */
#define GPIO_BSRR_BR6              GPIO_BSRR_BR6_Msk                     /*!< Port x reset I/O pin y */
#define GPIO_BSRR_BR7_Pos          (23U)
#define GPIO_BSRR_BR7_Msk          (0x1UL << GPIO_BSRR_BR7_Pos)          /*!< 0x00800000 */
#define GPIO_BSRR_BR7              GPIO_BSRR_BR7_Msk                     /*!< Port x reset I/O pin y */
#define GPIO_BSRR_BR8_Pos          (24U)
#define GPIO_BSRR_BR8_Msk          (0x1UL << GPIO_BSRR_BR8_Pos)          /*!< 0x01000000 */
#define GPIO_BSRR_BR8              GPIO_BSRR_BR8_Msk                     /*!< Port x reset I/O pin y */
#define GPIO_BSRR_BR9_Pos          (25U)
#define GPIO_BSRR_BR9_Msk          (0x1UL << GPIO_BSRR_BR9_Pos)          /*!< 0x02000000 */
#define GPIO_BSRR_BR9              GPIO_BSRR_BR9_Msk                     /*!< Port x reset I/O pin y */
#define GPIO_BSRR_BR10_Pos         (26U)
#define GPIO_BSRR_BR10_Msk         (0x1UL << GPIO_BSRR_BR10_Pos)         /*!< 0x04000000 */
#define GPIO_BSRR_BR10             GPIO_BSRR_BR10_Msk                    /*!< Port x reset I/O pin y */
#define GPIO_BSRR_BR11_Pos         (27U)
#define GPIO_BSRR_BR11_Msk         (0x1UL << GPIO_BSRR_BR11_Pos)         /*!< 0x08000000 */
#define GPIO_BSRR_BR11             GPIO_BSRR_BR11_Msk                    /*!< Port x reset I/O pin y */
#define GPIO_BSRR_BR12_Pos         (28U)
#define GPIO_BSRR_BR12_Msk         (0x1UL << GPIO_BSRR_BR12_Pos)         /*!< 0x10000000 */
#define GPIO_BSRR_BR12             GPIO_BSRR_BR12_Msk                    /*!< Port x reset I/O pin y */
#define GPIO_BSRR_BR13_Pos         (29U)
#define GPIO_BSRR_BR13_Msk         (0x1UL << GPIO_BSRR_BR13_Pos)         /*!< 0x20000000 */
#define GPIO_BSRR_BR13             GPIO_BSRR_BR13_Msk                    /*!< Port x reset I/O pin y */
#define GPIO_BSRR_BR14_Pos         (30U)
#define GPIO_BSRR_BR14_Msk         (0x1UL << GPIO_BSRR_BR14_Pos)         /*!< 0x40000000 */
#define GPIO_BSRR_BR14             GPIO_BSRR_BR14_Msk                    /*!< Port x reset I/O pin y */
#define GPIO_BSRR_BR15_Pos         (31U)
#define GPIO_BSRR_BR15_Msk         (0x1UL << GPIO_BSRR_BR15_Pos)         /*!< 0x80000000 */
#define GPIO_BSRR_BR15             GPIO_BSRR_BR15_Msk                    /*!< Port x reset I/O pin y */

/* ************************************  Bit definition for GPIO_LCKR register  ************************************* */
#define GPIO_LCKR_LCK0_Pos         (0U)
#define GPIO_LCKR_LCK0_Msk         (0x1UL << GPIO_LCKR_LCK0_Pos)         /*!< 0x00000001 */
#define GPIO_LCKR_LCK0             GPIO_LCKR_LCK0_Msk                    /*!< Port x lock I/O pin y */
#define GPIO_LCKR_LCK1_Pos         (1U)
#define GPIO_LCKR_LCK1_Msk         (0x1UL << GPIO_LCKR_LCK1_Pos)         /*!< 0x00000002 */
#define GPIO_LCKR_LCK1             GPIO_LCKR_LCK1_Msk                    /*!< Port x lock I/O pin y */
#define GPIO_LCKR_LCK2_Pos         (2U)
#define GPIO_LCKR_LCK2_Msk         (0x1UL << GPIO_LCKR_LCK2_Pos)         /*!< 0x00000004 */
#define GPIO_LCKR_LCK2             GPIO_LCKR_LCK2_Msk                    /*!< Port x lock I/O pin y */
#define GPIO_LCKR_LCK3_Pos         (3U)
#define GPIO_LCKR_LCK3_Msk         (0x1UL << GPIO_LCKR_LCK3_Pos)         /*!< 0x00000008 */
#define GPIO_LCKR_LCK3             GPIO_LCKR_LCK3_Msk                    /*!< Port x lock I/O pin y */
#define GPIO_LCKR_LCK4_Pos         (4U)
#define GPIO_LCKR_LCK4_Msk         (0x1UL << GPIO_LCKR_LCK4_Pos)         /*!< 0x00000010 */
#define GPIO_LCKR_LCK4             GPIO_LCKR_LCK4_Msk                    /*!< Port x lock I/O pin y */
#define GPIO_LCKR_LCK5_Pos         (5U)
#define GPIO_LCKR_LCK5_Msk         (0x1UL << GPIO_LCKR_LCK5_Pos)         /*!< 0x00000020 */
#define GPIO_LCKR_LCK5             GPIO_LCKR_LCK5_Msk                    /*!< Port x lock I/O pin y */
#define GPIO_LCKR_LCK6_Pos         (6U)
#define GPIO_LCKR_LCK6_Msk         (0x1UL << GPIO_LCKR_LCK6_Pos)         /*!< 0x00000040 */
#define GPIO_LCKR_LCK6             GPIO_LCKR_LCK6_Msk                    /*!< Port x lock I/O pin y */
#define GPIO_LCKR_LCK7_Pos         (7U)
#define GPIO_LCKR_LCK7_Msk         (0x1UL << GPIO_LCKR_LCK7_Pos)         /*!< 0x00000080 */
#define GPIO_LCKR_LCK7             GPIO_LCKR_LCK7_Msk                    /*!< Port x lock I/O pin y */
#define GPIO_LCKR_LCK8_Pos         (8U)
#define GPIO_LCKR_LCK8_Msk         (0x1UL << GPIO_LCKR_LCK8_Pos)         /*!< 0x00000100 */
#define GPIO_LCKR_LCK8             GPIO_LCKR_LCK8_Msk                    /*!< Port x lock I/O pin y */
#define GPIO_LCKR_LCK9_Pos         (9U)
#define GPIO_LCKR_LCK9_Msk         (0x1UL << GPIO_LCKR_LCK9_Pos)         /*!< 0x00000200 */
#define GPIO_LCKR_LCK9             GPIO_LCKR_LCK9_Msk                    /*!< Port x lock I/O pin y */
#define GPIO_LCKR_LCK10_Pos        (10U)
#define GPIO_LCKR_LCK10_Msk        (0x1UL << GPIO_LCKR_LCK10_Pos)        /*!< 0x00000400 */
#define GPIO_LCKR_LCK10            GPIO_LCKR_LCK10_Msk                   /*!< Port x lock I/O pin y */
#define GPIO_LCKR_LCK11_Pos        (11U)
#define GPIO_LCKR_LCK11_Msk        (0x1UL << GPIO_LCKR_LCK11_Pos)        /*!< 0x00000800 */
#define GPIO_LCKR_LCK11            GPIO_LCKR_LCK11_Msk                   /*!< Port x lock I/O pin y */
#define GPIO_LCKR_LCK12_Pos        (12U)
#define GPIO_LCKR_LCK12_Msk        (0x1UL << GPIO_LCKR_LCK12_Pos)        /*!< 0x00001000 */
#define GPIO_LCKR_LCK12            GPIO_LCKR_LCK12_Msk                   /*!< Port x lock I/O pin y */
#define GPIO_LCKR_LCK13_Pos        (13U)
#define GPIO_LCKR_LCK13_Msk        (0x1UL << GPIO_LCKR_LCK13_Pos)        /*!< 0x00002000 */
#define GPIO_LCKR_LCK13            GPIO_LCKR_LCK13_Msk                   /*!< Port x lock I/O pin y */
#define GPIO_LCKR_LCK14_Pos        (14U)
#define GPIO_LCKR_LCK14_Msk        (0x1UL << GPIO_LCKR_LCK14_Pos)        /*!< 0x00004000 */
#define GPIO_LCKR_LCK14            GPIO_LCKR_LCK14_Msk                   /*!< Port x lock I/O pin y */
#define GPIO_LCKR_LCK15_Pos        (15U)
#define GPIO_LCKR_LCK15_Msk        (0x1UL << GPIO_LCKR_LCK15_Pos)        /*!< 0x00008000 */
#define GPIO_LCKR_LCK15            GPIO_LCKR_LCK15_Msk                   /*!< Port x lock I/O pin y */
#define GPIO_LCKR_LCKK_Pos         (16U)
#define GPIO_LCKR_LCKK_Msk         (0x1UL << GPIO_LCKR_LCKK_Pos)         /*!< 0x00010000 */
#define GPIO_LCKR_LCKK             GPIO_LCKR_LCKK_Msk                    /*!< Lock key */

/* ************************************  Bit definition for GPIO_AFRL register  ************************************* */
#define GPIO_AFRL_AFSEL0_Pos       (0U)
#define GPIO_AFRL_AFSEL0_Msk       (0xFUL << GPIO_AFRL_AFSEL0_Pos)       /*!< 0x0000000F */
#define GPIO_AFRL_AFSEL0           GPIO_AFRL_AFSEL0_Msk                  /*!< Alternate function selection for port x
                                                                              I/O pin y */
#define GPIO_AFRL_AFSEL0_0         (0x1UL << GPIO_AFRL_AFSEL0_Pos)       /*!< 0x00000001 */
#define GPIO_AFRL_AFSEL0_1         (0x2UL << GPIO_AFRL_AFSEL0_Pos)       /*!< 0x00000002 */
#define GPIO_AFRL_AFSEL0_2         (0x4UL << GPIO_AFRL_AFSEL0_Pos)       /*!< 0x00000004 */
#define GPIO_AFRL_AFSEL0_3         (0x8UL << GPIO_AFRL_AFSEL0_Pos)       /*!< 0x00000008 */
#define GPIO_AFRL_AFSEL1_Pos       (4U)
#define GPIO_AFRL_AFSEL1_Msk       (0xFUL << GPIO_AFRL_AFSEL1_Pos)       /*!< 0x000000F0 */
#define GPIO_AFRL_AFSEL1           GPIO_AFRL_AFSEL1_Msk                  /*!< Alternate function selection for port x
                                                                             I/O pin y */
#define GPIO_AFRL_AFSEL1_0         (0x1UL << GPIO_AFRL_AFSEL1_Pos)       /*!< 0x00000010 */
#define GPIO_AFRL_AFSEL1_1         (0x2UL << GPIO_AFRL_AFSEL1_Pos)       /*!< 0x00000020 */
#define GPIO_AFRL_AFSEL1_2         (0x4UL << GPIO_AFRL_AFSEL1_Pos)       /*!< 0x00000040 */
#define GPIO_AFRL_AFSEL1_3         (0x8UL << GPIO_AFRL_AFSEL1_Pos)       /*!< 0x00000080 */
#define GPIO_AFRL_AFSEL2_Pos       (8U)
#define GPIO_AFRL_AFSEL2_Msk       (0xFUL << GPIO_AFRL_AFSEL2_Pos)       /*!< 0x00000F00 */
#define GPIO_AFRL_AFSEL2           GPIO_AFRL_AFSEL2_Msk                  /*!< Alternate function selection for port x
                                                                              I/O pin y */
#define GPIO_AFRL_AFSEL2_0         (0x1UL << GPIO_AFRL_AFSEL2_Pos)       /*!< 0x00000100 */
#define GPIO_AFRL_AFSEL2_1         (0x2UL << GPIO_AFRL_AFSEL2_Pos)       /*!< 0x00000200 */
#define GPIO_AFRL_AFSEL2_2         (0x4UL << GPIO_AFRL_AFSEL2_Pos)       /*!< 0x00000400 */
#define GPIO_AFRL_AFSEL2_3         (0x8UL << GPIO_AFRL_AFSEL2_Pos)       /*!< 0x00000800 */
#define GPIO_AFRL_AFSEL3_Pos       (12U)
#define GPIO_AFRL_AFSEL3_Msk       (0xFUL << GPIO_AFRL_AFSEL3_Pos)       /*!< 0x0000F000 */
#define GPIO_AFRL_AFSEL3           GPIO_AFRL_AFSEL3_Msk                  /*!< Alternate function selection for port x
                                                                              I/O pin y */
#define GPIO_AFRL_AFSEL3_0         (0x1UL << GPIO_AFRL_AFSEL3_Pos)       /*!< 0x00001000 */
#define GPIO_AFRL_AFSEL3_1         (0x2UL << GPIO_AFRL_AFSEL3_Pos)       /*!< 0x00002000 */
#define GPIO_AFRL_AFSEL3_2         (0x4UL << GPIO_AFRL_AFSEL3_Pos)       /*!< 0x00004000 */
#define GPIO_AFRL_AFSEL3_3         (0x8UL << GPIO_AFRL_AFSEL3_Pos)       /*!< 0x00008000 */
#define GPIO_AFRL_AFSEL4_Pos       (16U)
#define GPIO_AFRL_AFSEL4_Msk       (0xFUL << GPIO_AFRL_AFSEL4_Pos)       /*!< 0x000F0000 */
#define GPIO_AFRL_AFSEL4           GPIO_AFRL_AFSEL4_Msk                  /*!< Alternate function selection for port x
                                                                              I/O pin y */
#define GPIO_AFRL_AFSEL4_0         (0x1UL << GPIO_AFRL_AFSEL4_Pos)       /*!< 0x00010000 */
#define GPIO_AFRL_AFSEL4_1         (0x2UL << GPIO_AFRL_AFSEL4_Pos)       /*!< 0x00020000 */
#define GPIO_AFRL_AFSEL4_2         (0x4UL << GPIO_AFRL_AFSEL4_Pos)       /*!< 0x00040000 */
#define GPIO_AFRL_AFSEL4_3         (0x8UL << GPIO_AFRL_AFSEL4_Pos)       /*!< 0x00080000 */
#define GPIO_AFRL_AFSEL5_Pos       (20U)
#define GPIO_AFRL_AFSEL5_Msk       (0xFUL << GPIO_AFRL_AFSEL5_Pos)       /*!< 0x00F00000 */
#define GPIO_AFRL_AFSEL5           GPIO_AFRL_AFSEL5_Msk                  /*!< Alternate function selection for port x
                                                                              I/O pin y */
#define GPIO_AFRL_AFSEL5_0         (0x1UL << GPIO_AFRL_AFSEL5_Pos)       /*!< 0x00100000 */
#define GPIO_AFRL_AFSEL5_1         (0x2UL << GPIO_AFRL_AFSEL5_Pos)       /*!< 0x00200000 */
#define GPIO_AFRL_AFSEL5_2         (0x4UL << GPIO_AFRL_AFSEL5_Pos)       /*!< 0x00400000 */
#define GPIO_AFRL_AFSEL5_3         (0x8UL << GPIO_AFRL_AFSEL5_Pos)       /*!< 0x00800000 */
#define GPIO_AFRL_AFSEL6_Pos       (24U)
#define GPIO_AFRL_AFSEL6_Msk       (0xFUL << GPIO_AFRL_AFSEL6_Pos)       /*!< 0x0F000000 */
#define GPIO_AFRL_AFSEL6           GPIO_AFRL_AFSEL6_Msk                  /*!< Alternate function selection for port x
                                                                              I/O pin y */
#define GPIO_AFRL_AFSEL6_0         (0x1UL << GPIO_AFRL_AFSEL6_Pos)       /*!< 0x01000000 */
#define GPIO_AFRL_AFSEL6_1         (0x2UL << GPIO_AFRL_AFSEL6_Pos)       /*!< 0x02000000 */
#define GPIO_AFRL_AFSEL6_2         (0x4UL << GPIO_AFRL_AFSEL6_Pos)       /*!< 0x04000000 */
#define GPIO_AFRL_AFSEL6_3         (0x8UL << GPIO_AFRL_AFSEL6_Pos)       /*!< 0x08000000 */
#define GPIO_AFRL_AFSEL7_Pos       (28U)
#define GPIO_AFRL_AFSEL7_Msk       (0xFUL << GPIO_AFRL_AFSEL7_Pos)       /*!< 0xF0000000 */
#define GPIO_AFRL_AFSEL7           GPIO_AFRL_AFSEL7_Msk                  /*!< Alternate function selection for port x
                                                                              I/O pin y */
#define GPIO_AFRL_AFSEL7_0         (0x1UL << GPIO_AFRL_AFSEL7_Pos)       /*!< 0x10000000 */
#define GPIO_AFRL_AFSEL7_1         (0x2UL << GPIO_AFRL_AFSEL7_Pos)       /*!< 0x20000000 */
#define GPIO_AFRL_AFSEL7_2         (0x4UL << GPIO_AFRL_AFSEL7_Pos)       /*!< 0x40000000 */
#define GPIO_AFRL_AFSEL7_3         (0x8UL << GPIO_AFRL_AFSEL7_Pos)       /*!< 0x80000000 */

/* ************************************  Bit definition for GPIO_AFRH register  ************************************* */
#define GPIO_AFRH_AFSEL8_Pos       (0U)
#define GPIO_AFRH_AFSEL8_Msk       (0xFUL << GPIO_AFRH_AFSEL8_Pos)       /*!< 0x0000000F */
#define GPIO_AFRH_AFSEL8           GPIO_AFRH_AFSEL8_Msk                  /*!< Alternate function selection for port x
                                                                              I/O pin y */
#define GPIO_AFRH_AFSEL8_0         (0x1UL << GPIO_AFRH_AFSEL8_Pos)       /*!< 0x00000001 */
#define GPIO_AFRH_AFSEL8_1         (0x2UL << GPIO_AFRH_AFSEL8_Pos)       /*!< 0x00000002 */
#define GPIO_AFRH_AFSEL8_2         (0x4UL << GPIO_AFRH_AFSEL8_Pos)       /*!< 0x00000004 */
#define GPIO_AFRH_AFSEL8_3         (0x8UL << GPIO_AFRH_AFSEL8_Pos)       /*!< 0x00000008 */
#define GPIO_AFRH_AFSEL9_Pos       (4U)
#define GPIO_AFRH_AFSEL9_Msk       (0xFUL << GPIO_AFRH_AFSEL9_Pos)       /*!< 0x000000F0 */
#define GPIO_AFRH_AFSEL9           GPIO_AFRH_AFSEL9_Msk                  /*!< Alternate function selection for port x
                                                                              I/O pin y */
#define GPIO_AFRH_AFSEL9_0         (0x1UL << GPIO_AFRH_AFSEL9_Pos)       /*!< 0x00000010 */
#define GPIO_AFRH_AFSEL9_1         (0x2UL << GPIO_AFRH_AFSEL9_Pos)       /*!< 0x00000020 */
#define GPIO_AFRH_AFSEL9_2         (0x4UL << GPIO_AFRH_AFSEL9_Pos)       /*!< 0x00000040 */
#define GPIO_AFRH_AFSEL9_3         (0x8UL << GPIO_AFRH_AFSEL9_Pos)       /*!< 0x00000080 */
#define GPIO_AFRH_AFSEL10_Pos      (8U)
#define GPIO_AFRH_AFSEL10_Msk      (0xFUL << GPIO_AFRH_AFSEL10_Pos)      /*!< 0x00000F00 */
#define GPIO_AFRH_AFSEL10          GPIO_AFRH_AFSEL10_Msk                 /*!< Alternate function selection for port x
                                                                              I/O pin y */
#define GPIO_AFRH_AFSEL10_0        (0x1UL << GPIO_AFRH_AFSEL10_Pos)      /*!< 0x00000100 */
#define GPIO_AFRH_AFSEL10_1        (0x2UL << GPIO_AFRH_AFSEL10_Pos)      /*!< 0x00000200 */
#define GPIO_AFRH_AFSEL10_2        (0x4UL << GPIO_AFRH_AFSEL10_Pos)      /*!< 0x00000400 */
#define GPIO_AFRH_AFSEL10_3        (0x8UL << GPIO_AFRH_AFSEL10_Pos)      /*!< 0x00000800 */
#define GPIO_AFRH_AFSEL11_Pos      (12U)
#define GPIO_AFRH_AFSEL11_Msk      (0xFUL << GPIO_AFRH_AFSEL11_Pos)      /*!< 0x0000F000 */
#define GPIO_AFRH_AFSEL11          GPIO_AFRH_AFSEL11_Msk                 /*!< Alternate function selection for port x
                                                                              I/O pin y */
#define GPIO_AFRH_AFSEL11_0        (0x1UL << GPIO_AFRH_AFSEL11_Pos)      /*!< 0x00001000 */
#define GPIO_AFRH_AFSEL11_1        (0x2UL << GPIO_AFRH_AFSEL11_Pos)      /*!< 0x00002000 */
#define GPIO_AFRH_AFSEL11_2        (0x4UL << GPIO_AFRH_AFSEL11_Pos)      /*!< 0x00004000 */
#define GPIO_AFRH_AFSEL11_3        (0x8UL << GPIO_AFRH_AFSEL11_Pos)      /*!< 0x00008000 */
#define GPIO_AFRH_AFSEL12_Pos      (16U)
#define GPIO_AFRH_AFSEL12_Msk      (0xFUL << GPIO_AFRH_AFSEL12_Pos)      /*!< 0x000F0000 */
#define GPIO_AFRH_AFSEL12          GPIO_AFRH_AFSEL12_Msk                 /*!< Alternate function selection for port x
                                                                              I/O pin y */
#define GPIO_AFRH_AFSEL12_0        (0x1UL << GPIO_AFRH_AFSEL12_Pos)      /*!< 0x00010000 */
#define GPIO_AFRH_AFSEL12_1        (0x2UL << GPIO_AFRH_AFSEL12_Pos)      /*!< 0x00020000 */
#define GPIO_AFRH_AFSEL12_2        (0x4UL << GPIO_AFRH_AFSEL12_Pos)      /*!< 0x00040000 */
#define GPIO_AFRH_AFSEL12_3        (0x8UL << GPIO_AFRH_AFSEL12_Pos)      /*!< 0x00080000 */
#define GPIO_AFRH_AFSEL13_Pos      (20U)
#define GPIO_AFRH_AFSEL13_Msk      (0xFUL << GPIO_AFRH_AFSEL13_Pos)      /*!< 0x00F00000 */
#define GPIO_AFRH_AFSEL13          GPIO_AFRH_AFSEL13_Msk                 /*!< Alternate function selection for port x
                                                                              I/O pin y */
#define GPIO_AFRH_AFSEL13_0        (0x1UL << GPIO_AFRH_AFSEL13_Pos)      /*!< 0x00100000 */
#define GPIO_AFRH_AFSEL13_1        (0x2UL << GPIO_AFRH_AFSEL13_Pos)      /*!< 0x00200000 */
#define GPIO_AFRH_AFSEL13_2        (0x4UL << GPIO_AFRH_AFSEL13_Pos)      /*!< 0x00400000 */
#define GPIO_AFRH_AFSEL13_3        (0x8UL << GPIO_AFRH_AFSEL13_Pos)      /*!< 0x00800000 */
#define GPIO_AFRH_AFSEL14_Pos      (24U)
#define GPIO_AFRH_AFSEL14_Msk      (0xFUL << GPIO_AFRH_AFSEL14_Pos)      /*!< 0x0F000000 */
#define GPIO_AFRH_AFSEL14          GPIO_AFRH_AFSEL14_Msk                 /*!< Alternate function selection for port x
                                                                              I/O pin y */
#define GPIO_AFRH_AFSEL14_0        (0x1UL << GPIO_AFRH_AFSEL14_Pos)      /*!< 0x01000000 */
#define GPIO_AFRH_AFSEL14_1        (0x2UL << GPIO_AFRH_AFSEL14_Pos)      /*!< 0x02000000 */
#define GPIO_AFRH_AFSEL14_2        (0x4UL << GPIO_AFRH_AFSEL14_Pos)      /*!< 0x04000000 */
#define GPIO_AFRH_AFSEL14_3        (0x8UL << GPIO_AFRH_AFSEL14_Pos)      /*!< 0x08000000 */
#define GPIO_AFRH_AFSEL15_Pos      (28U)
#define GPIO_AFRH_AFSEL15_Msk      (0xFUL << GPIO_AFRH_AFSEL15_Pos)      /*!< 0xF0000000 */
#define GPIO_AFRH_AFSEL15          GPIO_AFRH_AFSEL15_Msk                 /*!< Alternate function selection for port x
                                                                              I/O pin y */
#define GPIO_AFRH_AFSEL15_0        (0x1UL << GPIO_AFRH_AFSEL15_Pos)      /*!< 0x10000000 */
#define GPIO_AFRH_AFSEL15_1        (0x2UL << GPIO_AFRH_AFSEL15_Pos)      /*!< 0x20000000 */
#define GPIO_AFRH_AFSEL15_2        (0x4UL << GPIO_AFRH_AFSEL15_Pos)      /*!< 0x40000000 */
#define GPIO_AFRH_AFSEL15_3        (0x8UL << GPIO_AFRH_AFSEL15_Pos)      /*!< 0x80000000 */

