MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c562xx.h
/******************  Bit definition for I2C_PECR register  *********************/
#define I2C_PECR_PEC_Pos                    (0U)
#define I2C_PECR_PEC_Msk                    (0xFFUL << I2C_PECR_PEC_Pos)            /*!< 0x000000FF */
#define I2C_PECR_PEC                        I2C_PECR_PEC_Msk                        /*!< PEC register */

/******************  Bit definition for I2C_RXDR register  *********************/
#define I2C_RXDR_RXDATA_Pos                 (0U)
#define I2C_RXDR_RXDATA_Msk                 (0xFFUL << I2C_RXDR_RXDATA_Pos)         /*!< 0x000000FF */
#define I2C_RXDR_RXDATA                     I2C_RXDR_RXDATA_Msk                     /*!< 8-bit receive data */

/******************  Bit definition for I2C_TXDR register  *********************/
#define I2C_TXDR_TXDATA_Pos                 (0U)
#define I2C_TXDR_TXDATA_Msk                 (0xFFUL << I2C_TXDR_TXDATA_Pos)         /*!< 0x000000FF */
#define I2C_TXDR_TXDATA                     I2C_TXDR_TXDATA_Msk                     /*!< 8-bit transmit data */

/******************************************************************************/
/*                                                                            */
/*             Improved Inter-integrated Circuit Interface (I3C)              */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for I3C_CR register  *********************/
#define I3C_CR_DCNT_Pos                 (0U)
#define I3C_CR_DCNT_Msk                 (0xFFFFUL << I3C_CR_DCNT_Pos)         /*!< 0x0000FFFF */
#define I3C_CR_DCNT                     I3C_CR_DCNT_Msk                       /*!< Data Byte Count */
#define I3C_CR_RNW_Pos                  (16U)
#define I3C_CR_RNW_Msk                  (0x1UL << I3C_CR_RNW_Pos)             /*!< 0x00010000 */
#define I3C_CR_RNW                      I3C_CR_RNW_Msk                        /*!< Read Not Write */
#define I3C_CR_CCC_Pos                  (16U)
#define I3C_CR_CCC_Msk                  (0xFFUL << I3C_CR_CCC_Pos)            /*!< 0x00FF0000 */
#define I3C_CR_CCC                      I3C_CR_CCC_Msk                        /*!< 8-Bit CCC code */
#define I3C_CR_ADD_Pos                  (17U)
#define I3C_CR_ADD_Msk                  (0x7FUL << I3C_CR_ADD_Pos)            /*!< 0x00FE0000 */
#define I3C_CR_ADD                      I3C_CR_ADD_Msk                        /*!< Target Address */
#define I3C_CR_MTYPE_Pos                (27U)
#define I3C_CR_MTYPE_Msk                (0xFUL << I3C_CR_MTYPE_Pos)           /*!< 0xF8000000 */
#define I3C_CR_MTYPE                    I3C_CR_MTYPE_Msk                      /*!< Message Type */
#define I3C_CR_MTYPE_0                  (0x1UL << I3C_CR_MTYPE_Pos)           /*!< 0x08000000 */
#define I3C_CR_MTYPE_1                  (0x2UL << I3C_CR_MTYPE_Pos)           /*!< 0x10000000 */
#define I3C_CR_MTYPE_2                  (0x4UL << I3C_CR_MTYPE_Pos)           /*!< 0x20000000 */
#define I3C_CR_MTYPE_3                  (0x8UL << I3C_CR_MTYPE_Pos)           /*!< 0x40000000 */
#define I3C_CR_MEND_Pos                 (31U)
#define I3C_CR_MEND_Msk                 (0x1UL << I3C_CR_MEND_Pos)            /*!< 0x80000000 */
#define I3C_CR_MEND                     I3C_CR_MEND_Msk                       /*!< Message End */

/*******************  Bit definition for I3C_CFGR register  *******************/
#define I3C_CFGR_EN_Pos                 (0U)
#define I3C_CFGR_EN_Msk                 (0x1UL << I3C_CFGR_EN_Pos)            /*!< 0x00000001 */
#define I3C_CFGR_EN                     I3C_CFGR_EN_Msk                       /*!< Peripheral Enable */
#define I3C_CFGR_CRINIT_Pos             (1U)
#define I3C_CFGR_CRINIT_Msk             (0x1UL << I3C_CFGR_CRINIT_Pos)        /*!< 0x00000002 */
#define I3C_CFGR_CRINIT                 I3C_CFGR_CRINIT_Msk                   /*!< Peripheral Init mode (Target/Controller) */
#define I3C_CFGR_NOARBH_Pos             (2U)
#define I3C_CFGR_NOARBH_Msk             (0x1UL << I3C_CFGR_NOARBH_Pos)        /*!< 0x00000004 */
#define I3C_CFGR_NOARBH                 I3C_CFGR_NOARBH_Msk                   /*!< No Arbitration Header (7'h7E)*/
#define I3C_CFGR_RSTPTRN_Pos            (3U)
#define I3C_CFGR_RSTPTRN_Msk            (0x1UL << I3C_CFGR_RSTPTRN_Pos)       /*!< 0x00000008 */
#define I3C_CFGR_RSTPTRN                I3C_CFGR_RSTPTRN_Msk                  /*!< Reset Pattern enable */
#define I3C_CFGR_EXITPTRN_Pos           (4U)
#define I3C_CFGR_EXITPTRN_Msk           (0x1UL << I3C_CFGR_EXITPTRN_Pos)      /*!< 0x00000010 */
#define I3C_CFGR_EXITPTRN               I3C_CFGR_EXITPTRN_Msk                 /*!< Exit Pattern enable */
#define I3C_CFGR_HKSDAEN_Pos            (5U)
#define I3C_CFGR_HKSDAEN_Msk            (0x1UL << I3C_CFGR_HKSDAEN_Pos)       /*!< 0x00000020 */
#define I3C_CFGR_HKSDAEN                I3C_CFGR_HKSDAEN_Msk                  /*!< High-Keeper on SDA Enable */
#define I3C_CFGR_HJACK_Pos              (7U)
#define I3C_CFGR_HJACK_Msk              (0x1UL << I3C_CFGR_HJACK_Pos)         /*!< 0x00000080 */
#define I3C_CFGR_HJACK                  I3C_CFGR_HJACK_Msk                    /*!< Hot Join Acknowledgment */
#define I3C_CFGR_RXDMAEN_Pos            (8U)
#define I3C_CFGR_RXDMAEN_Msk            (0x1UL << I3C_CFGR_RXDMAEN_Pos)       /*!< 0x00000100 */
#define I3C_CFGR_RXDMAEN                I3C_CFGR_RXDMAEN_Msk                  /*!< RX FIFO DMA mode Enable */
#define I3C_CFGR_RXFLUSH_Pos            (9U)
#define I3C_CFGR_RXFLUSH_Msk            (0x1UL << I3C_CFGR_RXFLUSH_Pos)       /*!< 0x00000200 */
#define I3C_CFGR_RXFLUSH                I3C_CFGR_RXFLUSH_Msk                  /*!< RX FIFO Flush */
#define I3C_CFGR_RXTHRES_Pos            (10U)
#define I3C_CFGR_RXTHRES_Msk            (0x1UL << I3C_CFGR_RXTHRES_Pos)       /*!< 0x00000400 */
#define I3C_CFGR_RXTHRES                I3C_CFGR_RXTHRES_Msk                  /*!< RX FIFO Threshold */
#define I3C_CFGR_TXDMAEN_Pos            (12U)
#define I3C_CFGR_TXDMAEN_Msk            (0x1UL << I3C_CFGR_TXDMAEN_Pos)       /*!< 0x00001000 */
#define I3C_CFGR_TXDMAEN                I3C_CFGR_TXDMAEN_Msk                  /*!< TX FIFO DMA mode Enable */
#define I3C_CFGR_TXFLUSH_Pos            (13U)
#define I3C_CFGR_TXFLUSH_Msk            (0x1UL << I3C_CFGR_TXFLUSH_Pos)       /*!< 0x00002000 */
#define I3C_CFGR_TXFLUSH                I3C_CFGR_TXFLUSH_Msk                  /*!< TX FIFO Flush */
#define I3C_CFGR_TXTHRES_Pos            (14U)
#define I3C_CFGR_TXTHRES_Msk            (0x1UL << I3C_CFGR_TXTHRES_Pos)       /*!< 0x00004000 */
#define I3C_CFGR_TXTHRES                I3C_CFGR_TXTHRES_Msk                  /*!< TX FIFO Threshold */
#define I3C_CFGR_SDMAEN_Pos             (16U)
#define I3C_CFGR_SDMAEN_Msk             (0x1UL << I3C_CFGR_SDMAEN_Pos)        /*!< 0x00010000 */
#define I3C_CFGR_SDMAEN                 I3C_CFGR_SDMAEN_Msk                   /*!< Status FIFO DMA mode Enable */
#define I3C_CFGR_SFLUSH_Pos             (17U)
#define I3C_CFGR_SFLUSH_Msk             (0x1UL << I3C_CFGR_SFLUSH_Pos)        /*!< 0x00020000 */
#define I3C_CFGR_SFLUSH                 I3C_CFGR_SFLUSH_Msk                   /*!< Status FIFO Flush */
#define I3C_CFGR_SMODE_Pos              (18U)
#define I3C_CFGR_SMODE_Msk              (0x1UL << I3C_CFGR_SMODE_Pos)         /*!< 0x00040000 */
#define I3C_CFGR_SMODE                  I3C_CFGR_SMODE_Msk                    /*!< Status FIFO mode Enable */
#define I3C_CFGR_TMODE_Pos              (19U)
#define I3C_CFGR_TMODE_Msk              (0x1UL << I3C_CFGR_TMODE_Pos)         /*!< 0x00080000 */
#define I3C_CFGR_TMODE                  I3C_CFGR_TMODE_Msk                    /*!< Control FIFO mode Enable */
#define I3C_CFGR_CDMAEN_Pos             (20U)
#define I3C_CFGR_CDMAEN_Msk             (0x1UL << I3C_CFGR_CDMAEN_Pos)        /*!< 0x00100000 */
#define I3C_CFGR_CDMAEN                 I3C_CFGR_CDMAEN_Msk                   /*!< Control FIFO DMA mode Enable */
#define I3C_CFGR_CFLUSH_Pos             (21U)
#define I3C_CFGR_CFLUSH_Msk             (0x1UL << I3C_CFGR_CFLUSH_Pos)        /*!< 0x00200000 */
#define I3C_CFGR_CFLUSH                 I3C_CFGR_CFLUSH_Msk                   /*!< Control FIFO Flush */
#define I3C_CFGR_FCFDIS_Pos             (23U)
#define I3C_CFGR_FCFDIS_Msk             (0x1UL << I3C_CFGR_FCFDIS_Pos)        /*!< 0x00800000 */
#define I3C_CFGR_FCFDIS                 I3C_CFGR_FCFDIS_Msk                   /*!< FCF generation disable */
#define I3C_CFGR_TSFSET_Pos             (30U)
#define I3C_CFGR_TSFSET_Msk             (0x1UL << I3C_CFGR_TSFSET_Pos)        /*!< 0x40000000 */
#define I3C_CFGR_TSFSET                 I3C_CFGR_TSFSET_Msk                   /*!< Transfer Set */

/*******************  Bit definition for I3C_RDR register  ********************/
#define I3C_RDR_RDB0_Pos                (0U)
#define I3C_RDR_RDB0_Msk                (0xFFUL << I3C_RDR_RDB0_Pos)          /*!< 0x000000FF */
#define I3C_RDR_RDB0                    I3C_RDR_RDB0_Msk                      /*!< Receive Data Byte */

/******************  Bit definition for I3C_RDWR register  ********************/
#define I3C_RDWR_RDBx_Pos               (0U)
#define I3C_RDWR_RDBx_Msk               (0xFFFFFFFFUL << I3C_RDWR_RDBx_Pos)   /*!< 0xFFFFFFFF */
#define I3C_RDWR_RDBx                   I3C_RDWR_RDBx_Msk                     /*!< Receive Data Byte, full double word */
#define I3C_RDWR_RDB0_Pos               (0U)
#define I3C_RDWR_RDB0_Msk               (0xFFUL << I3C_RDWR_RDB0_Pos)         /*!< 0x000000FF */
#define I3C_RDWR_RDB0                   I3C_RDWR_RDB0_Msk                     /*!< Receive Data Byte 0 */
#define I3C_RDWR_RDB1_Pos               (8U)
#define I3C_RDWR_RDB1_Msk               (0xFFUL << I3C_RDWR_RDB1_Pos)         /*!< 0x0000FF00 */
#define I3C_RDWR_RDB1                   I3C_RDWR_RDB1_Msk                     /*!< Receive Data Byte 1 */
#define I3C_RDWR_RDB2_Pos               (16U)
#define I3C_RDWR_RDB2_Msk               (0xFFUL << I3C_RDWR_RDB2_Pos)         /*!< 0x00FF0000 */
#define I3C_RDWR_RDB2                   I3C_RDWR_RDB2_Msk                     /*!< Receive Data Byte 2 */
#define I3C_RDWR_RDB3_Pos               (24U)
#define I3C_RDWR_RDB3_Msk               (0xFFUL << I3C_RDWR_RDB3_Pos)         /*!< 0xFF000000 */
#define I3C_RDWR_RDB3                   I3C_RDWR_RDB3_Msk                     /*!< Receive Data Byte 3 */

/*******************  Bit definition for I3C_TDR register  ********************/
#define I3C_TDR_TDB0_Pos                (0U)
#define I3C_TDR_TDB0_Msk                (0xFFUL << I3C_TDR_TDB0_Pos)          /*!< 0x000000FF */
#define I3C_TDR_TDB0                    I3C_TDR_TDB0_Msk                      /*!< Transmit Data Byte */

/******************  Bit definition for I3C_TDWR register  ********************/
#define I3C_TDWR_TDBx_Pos               (0U)
#define I3C_TDWR_TDBx_Msk               (0xFFFFFFFFUL << I3C_TDWR_TDBx_Pos)   /*!< 0xFFFFFFFF */
#define I3C_TDWR_TDBx                   I3C_TDWR_TDBx_Msk                     /*!< Transmit Data Byte, full double word */
#define I3C_TDWR_TDB0_Pos               (0U)
#define I3C_TDWR_TDB0_Msk               (0xFFUL << I3C_TDWR_TDB0_Pos)         /*!< 0x000000FF */
#define I3C_TDWR_TDB0                   I3C_TDWR_TDB0_Msk                     /*!< Transmit Data Byte 0 */
#define I3C_TDWR_TDB1_Pos               (8U)
#define I3C_TDWR_TDB1_Msk               (0xFFUL << I3C_TDWR_TDB1_Pos)         /*!< 0x0000FF00 */
#define I3C_TDWR_TDB1                   I3C_TDWR_TDB1_Msk                     /*!< Transmit Data Byte 1 */
#define I3C_TDWR_TDB2_Pos               (16U)
#define I3C_TDWR_TDB2_Msk               (0xFFUL << I3C_TDWR_TDB2_Pos)         /*!< 0x00FF0000 */
#define I3C_TDWR_TDB2                   I3C_TDWR_TDB2_Msk                     /*!< Transmit Data Byte 2 */
#define I3C_TDWR_TDB3_Pos               (24U)
#define I3C_TDWR_TDB3_Msk               (0xFFUL << I3C_TDWR_TDB3_Pos)         /*!< 0xFF000000 */
#define I3C_TDWR_TDB3                   I3C_TDWR_TDB3_Msk                     /*!< Transmit Data Byte 3 */

/*******************  Bit definition for I3C_IBIDR register  ******************/
#define I3C_IBIDR_IBIDBx_Pos            (0U)
#define I3C_IBIDR_IBIDBx_Msk            (0xFFFFFFFFUL << I3C_IBIDR_IBIDBx_Pos) /*!< 0xFFFFFFFF */
#define I3C_IBIDR_IBIDBx                I3C_IBIDR_IBIDBx_Msk                   /*!< IBI Data Byte, full double word */
#define I3C_IBIDR_IBIDB0_Pos            (0U)
#define I3C_IBIDR_IBIDB0_Msk            (0xFFUL << I3C_IBIDR_IBIDB0_Pos)       /*!< 0x000000FF */
#define I3C_IBIDR_IBIDB0                I3C_IBIDR_IBIDB0_Msk                   /*!< IBI Data Byte 0 */
#define I3C_IBIDR_IBIDB1_Pos            (8U)
#define I3C_IBIDR_IBIDB1_Msk            (0xFFUL << I3C_IBIDR_IBIDB1_Pos)       /*!< 0x0000FF00 */
#define I3C_IBIDR_IBIDB1                I3C_IBIDR_IBIDB1_Msk                   /*!< IBI Data Byte 1 */
#define I3C_IBIDR_IBIDB2_Pos            (16U)
#define I3C_IBIDR_IBIDB2_Msk            (0xFFUL << I3C_IBIDR_IBIDB2_Pos)       /*!< 0x00FF0000 */
#define I3C_IBIDR_IBIDB2                I3C_IBIDR_IBIDB2_Msk                   /*!< IBI Data Byte 2 */
#define I3C_IBIDR_IBIDB3_Pos            (24U)
#define I3C_IBIDR_IBIDB3_Msk            (0xFFUL << I3C_IBIDR_IBIDB3_Pos)       /*!< 0xFF000000 */
#define I3C_IBIDR_IBIDB3                I3C_IBIDR_IBIDB3_Msk                   /*!< IBI Data Byte 3 */

/******************  Bit definition for I3C_TGTTDR register  ******************/
#define I3C_TGTTDR_TGTTDCNT_Pos         (0U)
#define I3C_TGTTDR_TGTTDCNT_Msk         (0xFFFFUL << I3C_TGTTDR_TGTTDCNT_Pos)   /*!< 0x0000FFFF */
#define I3C_TGTTDR_TGTTDCNT             I3C_TGTTDR_TGTTDCNT_Msk                 /*!< Target Transmit Data Counter */
#define I3C_TGTTDR_PRELOAD_Pos          (16U)
#define I3C_TGTTDR_PRELOAD_Msk          (0x1UL << I3C_TGTTDR_PRELOAD_Pos)       /*!< 0x00010000 */
#define I3C_TGTTDR_PRELOAD              I3C_TGTTDR_PRELOAD_Msk                  /*!< Transmit FIFO Preload Enable/Status */

