MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c562xx.h
/* ***********************************  Bit definition for ICACHE_CRRx register  ************************************ */
#define ICACHE_CRRx_BASEADDR_Pos  (0U)
#define ICACHE_CRRx_BASEADDR_Msk  (0xFFUL << ICACHE_CRRx_BASEADDR_Pos)   /*!< 0x000000FF */
#define ICACHE_CRRx_BASEADDR      ICACHE_CRRx_BASEADDR_Msk               /*!< base address for region x */
#define ICACHE_CRRx_BASEADDR_0    (0x1UL << ICACHE_CRRx_BASEADDR_Pos)    /*!< 0x00000001 */
#define ICACHE_CRRx_BASEADDR_1    (0x2UL << ICACHE_CRRx_BASEADDR_Pos)    /*!< 0x00000002 */
#define ICACHE_CRRx_BASEADDR_2    (0x4UL << ICACHE_CRRx_BASEADDR_Pos)    /*!< 0x00000004 */
#define ICACHE_CRRx_BASEADDR_3    (0x8UL << ICACHE_CRRx_BASEADDR_Pos)    /*!< 0x00000008 */
#define ICACHE_CRRx_BASEADDR_4    (0x10UL << ICACHE_CRRx_BASEADDR_Pos)   /*!< 0x00000010 */
#define ICACHE_CRRx_BASEADDR_5    (0x20UL << ICACHE_CRRx_BASEADDR_Pos)   /*!< 0x00000020 */
#define ICACHE_CRRx_BASEADDR_6    (0x40UL << ICACHE_CRRx_BASEADDR_Pos)   /*!< 0x00000040 */
#define ICACHE_CRRx_BASEADDR_7    (0x80UL << ICACHE_CRRx_BASEADDR_Pos)   /*!< 0x00000080 */
#define ICACHE_CRRx_RSIZE_Pos     (9U)
#define ICACHE_CRRx_RSIZE_Msk     (0x7UL << ICACHE_CRRx_RSIZE_Pos)       /*!< 0x00000E00 */
#define ICACHE_CRRx_RSIZE         ICACHE_CRRx_RSIZE_Msk                  /*!< size for region x */
#define ICACHE_CRRx_RSIZE_0       (0x1UL << ICACHE_CRRx_RSIZE_Pos)       /*!< 0x00000200 */
#define ICACHE_CRRx_RSIZE_1       (0x2UL << ICACHE_CRRx_RSIZE_Pos)       /*!< 0x00000400 */
#define ICACHE_CRRx_RSIZE_2       (0x4UL << ICACHE_CRRx_RSIZE_Pos)       /*!< 0x00000800 */
#define ICACHE_CRRx_REN_Pos       (15U)
#define ICACHE_CRRx_REN_Msk       (0x1UL << ICACHE_CRRx_REN_Pos)         /*!< 0x00008000 */
#define ICACHE_CRRx_REN           ICACHE_CRRx_REN_Msk                    /*!< enable for region x */
#define ICACHE_CRRx_REMAPADDR_Pos (16U)
#define ICACHE_CRRx_REMAPADDR_Msk (0x7FFUL << ICACHE_CRRx_REMAPADDR_Pos) /*!< 0x07FF0000 */
#define ICACHE_CRRx_REMAPADDR     ICACHE_CRRx_REMAPADDR_Msk              /*!< remapped address for region x */
#define ICACHE_CRRx_REMAPADDR_0   (0x1UL << ICACHE_CRRx_REMAPADDR_Pos)   /*!< 0x00010000 */
#define ICACHE_CRRx_REMAPADDR_1   (0x2UL << ICACHE_CRRx_REMAPADDR_Pos)   /*!< 0x00020000 */
#define ICACHE_CRRx_REMAPADDR_2   (0x4UL << ICACHE_CRRx_REMAPADDR_Pos)   /*!< 0x00040000 */
#define ICACHE_CRRx_REMAPADDR_3   (0x8UL << ICACHE_CRRx_REMAPADDR_Pos)   /*!< 0x00080000 */
#define ICACHE_CRRx_REMAPADDR_4   (0x10UL << ICACHE_CRRx_REMAPADDR_Pos)  /*!< 0x00100000 */
#define ICACHE_CRRx_REMAPADDR_5   (0x20UL << ICACHE_CRRx_REMAPADDR_Pos)  /*!< 0x00200000 */
#define ICACHE_CRRx_REMAPADDR_6   (0x40UL << ICACHE_CRRx_REMAPADDR_Pos)  /*!< 0x00400000 */
#define ICACHE_CRRx_REMAPADDR_7   (0x80UL << ICACHE_CRRx_REMAPADDR_Pos)  /*!< 0x00800000 */
#define ICACHE_CRRx_REMAPADDR_8   (0x100UL << ICACHE_CRRx_REMAPADDR_Pos) /*!< 0x01000000 */
#define ICACHE_CRRx_REMAPADDR_9   (0x200UL << ICACHE_CRRx_REMAPADDR_Pos) /*!< 0x02000000 */
#define ICACHE_CRRx_REMAPADDR_10  (0x400UL << ICACHE_CRRx_REMAPADDR_Pos) /*!< 0x04000000 */
#define ICACHE_CRRx_HBURST_Pos    (31U)
#define ICACHE_CRRx_HBURST_Msk    (0x1UL << ICACHE_CRRx_HBURST_Pos)      /*!< 0x80000000 */
#define ICACHE_CRRx_HBURST        ICACHE_CRRx_HBURST_Msk                 /*!< output burst type for region x */

/**********************************************************************************************************************/
/*                                                                                                                    */
/*                                            Power Control (PWR)                                                     */
/*                                                                                                                    */
/**********************************************************************************************************************/
/* *************************************  Bit definition for PWR_PMCR register  ************************************* */
#define PWR_PMCR_LPMS_Pos          (0U)
#define PWR_PMCR_LPMS_Msk          (0x3UL << PWR_PMCR_LPMS_Pos)            /*!< 0x00000003 */
#define PWR_PMCR_LPMS              PWR_PMCR_LPMS_Msk                       /*!< low-power mode selection */
#define PWR_PMCR_LPMS_0            (0x1UL << PWR_PMCR_LPMS_Pos)            /*!< 0x00000001 */
#define PWR_PMCR_LPMS_1            (0x2UL << PWR_PMCR_LPMS_Pos)            /*!< 0x00000002 */
#define PWR_PMCR_CSSF_Pos          (7U)
#define PWR_PMCR_CSSF_Msk          (0x1UL << PWR_PMCR_CSSF_Pos)            /*!< 0x00000080 */
#define PWR_PMCR_CSSF              PWR_PMCR_CSSF_Msk                       /*!< Clear Standby and Stop flags (always
                                                                                read as 0) */
#define PWR_PMCR_FLPS_Pos          (9U)
#define PWR_PMCR_FLPS_Msk          (0x1UL << PWR_PMCR_FLPS_Pos)            /*!< 0x00000200 */
#define PWR_PMCR_FLPS              PWR_PMCR_FLPS_Msk                       /*!< Flash memory low-power mode in Stop mode
                                                                                */
#define PWR_PMCR_SRAM2_1_SO_Pos    (24U)
#define PWR_PMCR_SRAM2_1_SO_Msk    (0x1UL << PWR_PMCR_SRAM2_1_SO_Pos)      /*!< 0x01000000 */
#define PWR_PMCR_SRAM2_1_SO        PWR_PMCR_SRAM2_1_SO_Msk                 /*!< AHB SRAM2 block 1 shut-off in Stop mode
                                                                                */
#define PWR_PMCR_SRAM2_2_SO_Pos    (25U)
#define PWR_PMCR_SRAM2_2_SO_Msk    (0x1UL << PWR_PMCR_SRAM2_2_SO_Pos)      /*!< 0x02000000 */
#define PWR_PMCR_SRAM2_2_SO        PWR_PMCR_SRAM2_2_SO_Msk                 /*!< AHB SRAM2 block 2 shut-off in Stop mode
                                                                                */
#define PWR_PMCR_SRAM1SO_Pos       (26U)
#define PWR_PMCR_SRAM1SO_Msk       (0x1UL << PWR_PMCR_SRAM1SO_Pos)         /*!< 0x04000000 */
#define PWR_PMCR_SRAM1SO           PWR_PMCR_SRAM1SO_Msk                    /*!< AHB SRAM1 block 1 shut-off in Stop mode
                                                                                */

/* *************************************  Bit definition for PWR_PMSR register  ************************************* */
#define PWR_PMSR_STOPF_Pos         (5U)
#define PWR_PMSR_STOPF_Msk         (0x1UL << PWR_PMSR_STOPF_Pos)           /*!< 0x00000020 */
#define PWR_PMSR_STOPF             PWR_PMSR_STOPF_Msk                      /*!< Stop flag */
#define PWR_PMSR_SBF_Pos           (6U)
#define PWR_PMSR_SBF_Msk           (0x1UL << PWR_PMSR_SBF_Pos)             /*!< 0x00000040 */
#define PWR_PMSR_SBF               PWR_PMSR_SBF_Msk                        /*!< System standby flag */

/* ************************************  Bit definition for PWR_RTCCR register  ************************************* */
#define PWR_RTCCR_DRTCP_Pos        (0U)
#define PWR_RTCCR_DRTCP_Msk        (0x1UL << PWR_RTCCR_DRTCP_Pos)          /*!< 0x00000001 */
#define PWR_RTCCR_DRTCP            PWR_RTCCR_DRTCP_Msk                     /*!< Disable RTC domain write protection */

/* *************************************  Bit definition for PWR_VMCR register  ************************************* */
#define PWR_VMCR_PVDE_Pos          (0U)
#define PWR_VMCR_PVDE_Msk          (0x1UL << PWR_VMCR_PVDE_Pos)            /*!< 0x00000001 */
#define PWR_VMCR_PVDE              PWR_VMCR_PVDE_Msk                       /*!< PVD enable */

/* *************************************  Bit definition for PWR_VMSR register  ************************************* */
#define PWR_VMSR_PVDO_Pos          (22U)
#define PWR_VMSR_PVDO_Msk          (0x1UL << PWR_VMSR_PVDO_Pos)            /*!< 0x00400000 */
#define PWR_VMSR_PVDO              PWR_VMSR_PVDO_Msk                       /*!< programmable voltage detect output */

